import 'package:flutter_travel_ui/models/trip_model.dart';

import 'ihotel_model.dart';

class Province {
  String name;
  String center;
  String imageUrl;
  String logo;
  String address;
  String shortDesc;
  int distanceFromUb;
  String timeToReach;
  List<String> mustVisitPlaces;
  List<IHotel> hotels;
  List<Trip> trips;

  Province({
    this.name,
    this.center,
    this.imageUrl,
    this.logo,
    this.address,
    this.shortDesc,
    this.distanceFromUb,
    this.timeToReach,
    this.mustVisitPlaces,
    this.hotels,
    this.trips,
  });
}

final List<Province> provinces = [
  Province(
    name: 'Архангай',
    center: 'Цэцэрлэг',
    logo:
        'https://upload.wikimedia.org/wikipedia/commons/9/94/Mn_coa_arkhangai_aimag_2014.png',
    address:
        'https://upload.wikimedia.org/wikipedia/commons/b/be/Arkhangai_in_Mongolia.svg',
    shortDesc:
        'Архангай аймаг нь хамгийн хийх жуулчид аялдаг аймгийн нэг бөгөөд Өгий, Тэрхийн цагаан зэрэг нуур болон Хорго, Тайхар чулуу зэрэг галт уулархаг тогтцоороо олны анхаарлыг татдаг. Жилийн дөрвөн улиралд байгалийн үзэсгэлэнт газрууд болон түүхийн гайхамшгуудаараа, Монгол малч ахуйгаараа, уламжлалт ёс, зан үйлээрээ аялал жуулчлалыг хөгжүүлэх бүрэн боломжтой бүс нутаг юм.',
    distanceFromUb: 430,
    timeToReach: '6 цаг 24 мин',
    mustVisitPlaces: [
      '1. Чулуутын гол',
      '2. Хоргын тогоо',
      '3. Тэрхийн цагаан нуур',
      '4. Суварга хайрхан уул',
      '5. Тамирын гол',
      '6. Булган уул',
      '7. Тайхар чулуу',
      '8. Хар балгас',
      '9. Билгэ хааны цогцолбор',
    ],
    hotels: ihotels,
    trips: trips,
    imageUrl: 'assets/images/bayanulgii.jpg',
  ),
  Province(
    name: 'Баян-Өлгий',
    center: 'Баянхонгор',
    logo:
        'https://upload.wikimedia.org/wikipedia/commons/1/1b/Mn_coa_bayankhongor_aymag.png',
    address:
        'https://upload.wikimedia.org/wikipedia/commons/7/7a/Bayankhongor_in_Mongolia.svg',
    shortDesc:
        'Баянхонгор аймаг нь Монголын баруун өмнөд хэсэгт Хангайн нурууны өмнөх өндөрлөг, Говь-Алтайн нурууны уулс, Алтайн өврийн говийг хамран говь хангайн бүсийг дамнан оршдог аймаг юм. Иймд нутаг нь уул тал хөндий хосолсон хэлбэр бүхий гадаргатай. Зээрэнгийн хөндий, Номингийн говь зэрэг Алтайн өврийн их говиуд, Байдраг, Түй зэрэг томоохон гол мөрдтэй, Бөөнцагаан, Орог нуур, Хөх нуур зэрэг том нууруудтай. Мөн 95 хэм хүрдэг халуунтай Шаргалжуутын рашаан болон Өүхэг рашаан, Хүрэмт рашаан, Халиут рашаан, Өргөөтийн рашаан гэж сайн рашаанууд бий.',
    distanceFromUb: 630,
    timeToReach: '8 цаг 55 мин',
    mustVisitPlaces: [
      '1. Цагаан агуй',
      '2. Бичигтхад',
      '3. Шатар чулуун хөшөө',
      '4. Түрэгийн үеийн бичээс',
      '5. Бүгийн цавийн хоолой',
      '6. Шаргалжуутын халуун рашаан',
      '7. Их Богд уул',
    ],
    hotels: ihotels,
    trips: trips,
    imageUrl: 'assets/images/bayanulgii.jpg',
  ),
  Province(
    name: 'Булган',
    center: 'Булган',
    logo:
        'https://upload.wikimedia.org/wikipedia/commons/a/a3/Mn_coa_bulgan_aimag.svg',
    address:
        'https://upload.wikimedia.org/wikipedia/commons/0/01/Bulgan_in_Mongolia.svg',
    shortDesc:
        'Булган аймаг нь Монгол орны хойд хэсэг, Хангайн бүсийн уулархаг хэсэгт ордог бөгөөд хойд талаараа ОХУ-тай хиллэдэг. Улаанбаатар, Дархан, Эрдэнэт хотуудтай хатуу хучилттай замаар холбогдсон, Монгол улсын хэвтээ болон босоо тэнхлэгийн төв зам 5 сумаар дайран өнгөрдөг. Тус аймаг нь байгийн үзэсгэлэнт газар ихтэй, аялал жуулчлалын бүс нутагт оршдог. Булган аймгийн нутагт Сэлэнгэ, Орхон, Хануй зэрэг том голууд урсах бөгөөд Харгал, Хунт, Айрхан зэрэг нуурууд, Хульж, Хунт, Хануйн, Асгатын зэрэг рашаан бий.',
    distanceFromUb: 326,
    timeToReach: '5 цаг 54 мин',
    mustVisitPlaces: [
      '1. Хөгнө тарна байгалийн цогцолборт газар',
      '2. Уран тогоо уул',
      '3. Шивээт улааны цогцолбор',
      '4. Хар бухын балгас',
      '5. Чин толгойн балгас',
      '6. Бий булгын балгас',
      '7. Могойн шинэ ус',
    ],
    hotels: ihotels,
    trips: trips,
    imageUrl: 'assets/images/bayanulgii.jpg',
  ),
  Province(
    name: 'Булган',
    center: 'Булган',
    logo:
        'https://upload.wikimedia.org/wikipedia/commons/a/a3/Mn_coa_bulgan_aimag.svg',
    address:
        'https://upload.wikimedia.org/wikipedia/commons/0/01/Bulgan_in_Mongolia.svg',
    shortDesc:
        'Булган аймаг нь Монгол орны хойд хэсэг, Хангайн бүсийн уулархаг хэсэгт ордог бөгөөд хойд талаараа ОХУ-тай хиллэдэг. Улаанбаатар, Дархан, Эрдэнэт хотуудтай хатуу хучилттай замаар холбогдсон, Монгол улсын хэвтээ болон босоо тэнхлэгийн төв зам 5 сумаар дайран өнгөрдөг. Тус аймаг нь байгийн үзэсгэлэнт газар ихтэй, аялал жуулчлалын бүс нутагт оршдог. Булган аймгийн нутагт Сэлэнгэ, Орхон, Хануй зэрэг том голууд урсах бөгөөд Харгал, Хунт, Айрхан зэрэг нуурууд, Хульж, Хунт, Хануйн, Асгатын зэрэг рашаан бий.',
    distanceFromUb: 326,
    timeToReach: '5 цаг 54 мин',
    mustVisitPlaces: [
      '1. Хөгнө тарна байгалийн цогцолборт газар',
      '2. Уран тогоо уул',
      '3. Шивээт улааны цогцолбор',
      '4. Хар бухын балгас',
      '5. Чин толгойн балгас',
      '6. Бий булгын балгас',
      '7. Могойн шинэ ус',
    ],
    hotels: ihotels,
    trips: trips,
    imageUrl: 'assets/images/bayanulgii.jpg',
  ),
  Province(
    name: 'Булган',
    center: 'Булган',
    logo:
        'https://upload.wikimedia.org/wikipedia/commons/a/a3/Mn_coa_bulgan_aimag.svg',
    address:
        'https://upload.wikimedia.org/wikipedia/commons/0/01/Bulgan_in_Mongolia.svg',
    shortDesc:
        'Булган аймаг нь Монгол орны хойд хэсэг, Хангайн бүсийн уулархаг хэсэгт ордог бөгөөд хойд талаараа ОХУ-тай хиллэдэг. Улаанбаатар, Дархан, Эрдэнэт хотуудтай хатуу хучилттай замаар холбогдсон, Монгол улсын хэвтээ болон босоо тэнхлэгийн төв зам 5 сумаар дайран өнгөрдөг. Тус аймаг нь байгийн үзэсгэлэнт газар ихтэй, аялал жуулчлалын бүс нутагт оршдог. Булган аймгийн нутагт Сэлэнгэ, Орхон, Хануй зэрэг том голууд урсах бөгөөд Харгал, Хунт, Айрхан зэрэг нуурууд, Хульж, Хунт, Хануйн, Асгатын зэрэг рашаан бий.',
    distanceFromUb: 326,
    timeToReach: '5 цаг 54 мин',
    mustVisitPlaces: [
      '1. Хөгнө тарна байгалийн цогцолборт газар',
      '2. Уран тогоо уул',
      '3. Шивээт улааны цогцолбор',
      '4. Хар бухын балгас',
      '5. Чин толгойн балгас',
      '6. Бий булгын балгас',
      '7. Могойн шинэ ус',
    ],
    hotels: ihotels,
    trips: trips,
    imageUrl: 'assets/images/bayanulgii.jpg',
  ),
  Province(
    name: 'Булган',
    center: 'Булган',
    logo:
        'https://upload.wikimedia.org/wikipedia/commons/a/a3/Mn_coa_bulgan_aimag.svg',
    address:
        'https://upload.wikimedia.org/wikipedia/commons/0/01/Bulgan_in_Mongolia.svg',
    shortDesc:
        'Булган аймаг нь Монгол орны хойд хэсэг, Хангайн бүсийн уулархаг хэсэгт ордог бөгөөд хойд талаараа ОХУ-тай хиллэдэг. Улаанбаатар, Дархан, Эрдэнэт хотуудтай хатуу хучилттай замаар холбогдсон, Монгол улсын хэвтээ болон босоо тэнхлэгийн төв зам 5 сумаар дайран өнгөрдөг. Тус аймаг нь байгийн үзэсгэлэнт газар ихтэй, аялал жуулчлалын бүс нутагт оршдог. Булган аймгийн нутагт Сэлэнгэ, Орхон, Хануй зэрэг том голууд урсах бөгөөд Харгал, Хунт, Айрхан зэрэг нуурууд, Хульж, Хунт, Хануйн, Асгатын зэрэг рашаан бий.',
    distanceFromUb: 326,
    timeToReach: '5 цаг 54 мин',
    mustVisitPlaces: [
      '1. Хөгнө тарна байгалийн цогцолборт газар',
      '2. Уран тогоо уул',
      '3. Шивээт улааны цогцолбор',
      '4. Хар бухын балгас',
      '5. Чин толгойн балгас',
      '6. Бий булгын балгас',
      '7. Могойн шинэ ус',
    ],
    hotels: ihotels,
    trips: trips,
    imageUrl: 'assets/images/bayanulgii.jpg',
  ),
  Province(
    name: 'Булган',
    center: 'Булган',
    logo:
        'https://upload.wikimedia.org/wikipedia/commons/a/a3/Mn_coa_bulgan_aimag.svg',
    address:
        'https://upload.wikimedia.org/wikipedia/commons/0/01/Bulgan_in_Mongolia.svg',
    shortDesc:
        'Булган аймаг нь Монгол орны хойд хэсэг, Хангайн бүсийн уулархаг хэсэгт ордог бөгөөд хойд талаараа ОХУ-тай хиллэдэг. Улаанбаатар, Дархан, Эрдэнэт хотуудтай хатуу хучилттай замаар холбогдсон, Монгол улсын хэвтээ болон босоо тэнхлэгийн төв зам 5 сумаар дайран өнгөрдөг. Тус аймаг нь байгийн үзэсгэлэнт газар ихтэй, аялал жуулчлалын бүс нутагт оршдог. Булган аймгийн нутагт Сэлэнгэ, Орхон, Хануй зэрэг том голууд урсах бөгөөд Харгал, Хунт, Айрхан зэрэг нуурууд, Хульж, Хунт, Хануйн, Асгатын зэрэг рашаан бий.',
    distanceFromUb: 326,
    timeToReach: '5 цаг 54 мин',
    mustVisitPlaces: [
      '1. Хөгнө тарна байгалийн цогцолборт газар',
      '2. Уран тогоо уул',
      '3. Шивээт улааны цогцолбор',
      '4. Хар бухын балгас',
      '5. Чин толгойн балгас',
      '6. Бий булгын балгас',
      '7. Могойн шинэ ус',
    ],
    hotels: ihotels,
    trips: trips,
    imageUrl: 'assets/images/bayanulgii.jpg',
  ),
  Province(
    name: 'Булган',
    center: 'Булган',
    logo:
        'https://upload.wikimedia.org/wikipedia/commons/a/a3/Mn_coa_bulgan_aimag.svg',
    address:
        'https://upload.wikimedia.org/wikipedia/commons/0/01/Bulgan_in_Mongolia.svg',
    shortDesc:
        'Булган аймаг нь Монгол орны хойд хэсэг, Хангайн бүсийн уулархаг хэсэгт ордог бөгөөд хойд талаараа ОХУ-тай хиллэдэг. Улаанбаатар, Дархан, Эрдэнэт хотуудтай хатуу хучилттай замаар холбогдсон, Монгол улсын хэвтээ болон босоо тэнхлэгийн төв зам 5 сумаар дайран өнгөрдөг. Тус аймаг нь байгийн үзэсгэлэнт газар ихтэй, аялал жуулчлалын бүс нутагт оршдог. Булган аймгийн нутагт Сэлэнгэ, Орхон, Хануй зэрэг том голууд урсах бөгөөд Харгал, Хунт, Айрхан зэрэг нуурууд, Хульж, Хунт, Хануйн, Асгатын зэрэг рашаан бий.',
    distanceFromUb: 326,
    timeToReach: '5 цаг 54 мин',
    mustVisitPlaces: [
      '1. Хөгнө тарна байгалийн цогцолборт газар',
      '2. Уран тогоо уул',
      '3. Шивээт улааны цогцолбор',
      '4. Хар бухын балгас',
      '5. Чин толгойн балгас',
      '6. Бий булгын балгас',
      '7. Могойн шинэ ус',
    ],
    hotels: ihotels,
    trips: trips,
    imageUrl: 'assets/images/bayanulgii.jpg',
  ),
  Province(
    name: 'Булган',
    center: 'Булган',
    logo:
        'https://upload.wikimedia.org/wikipedia/commons/a/a3/Mn_coa_bulgan_aimag.svg',
    address:
        'https://upload.wikimedia.org/wikipedia/commons/0/01/Bulgan_in_Mongolia.svg',
    shortDesc:
        'Булган аймаг нь Монгол орны хойд хэсэг, Хангайн бүсийн уулархаг хэсэгт ордог бөгөөд хойд талаараа ОХУ-тай хиллэдэг. Улаанбаатар, Дархан, Эрдэнэт хотуудтай хатуу хучилттай замаар холбогдсон, Монгол улсын хэвтээ болон босоо тэнхлэгийн төв зам 5 сумаар дайран өнгөрдөг. Тус аймаг нь байгийн үзэсгэлэнт газар ихтэй, аялал жуулчлалын бүс нутагт оршдог. Булган аймгийн нутагт Сэлэнгэ, Орхон, Хануй зэрэг том голууд урсах бөгөөд Харгал, Хунт, Айрхан зэрэг нуурууд, Хульж, Хунт, Хануйн, Асгатын зэрэг рашаан бий.',
    distanceFromUb: 326,
    timeToReach: '5 цаг 54 мин',
    mustVisitPlaces: [
      '1. Хөгнө тарна байгалийн цогцолборт газар',
      '2. Уран тогоо уул',
      '3. Шивээт улааны цогцолбор',
      '4. Хар бухын балгас',
      '5. Чин толгойн балгас',
      '6. Бий булгын балгас',
      '7. Могойн шинэ ус',
    ],
    hotels: ihotels,
    trips: trips,
    imageUrl: 'assets/images/bayanulgii.jpg',
  ),
  Province(
    name: 'Булган',
    center: 'Булган',
    logo:
        'https://upload.wikimedia.org/wikipedia/commons/a/a3/Mn_coa_bulgan_aimag.svg',
    address:
        'https://upload.wikimedia.org/wikipedia/commons/0/01/Bulgan_in_Mongolia.svg',
    shortDesc:
        'Булган аймаг нь Монгол орны хойд хэсэг, Хангайн бүсийн уулархаг хэсэгт ордог бөгөөд хойд талаараа ОХУ-тай хиллэдэг. Улаанбаатар, Дархан, Эрдэнэт хотуудтай хатуу хучилттай замаар холбогдсон, Монгол улсын хэвтээ болон босоо тэнхлэгийн төв зам 5 сумаар дайран өнгөрдөг. Тус аймаг нь байгийн үзэсгэлэнт газар ихтэй, аялал жуулчлалын бүс нутагт оршдог. Булган аймгийн нутагт Сэлэнгэ, Орхон, Хануй зэрэг том голууд урсах бөгөөд Харгал, Хунт, Айрхан зэрэг нуурууд, Хульж, Хунт, Хануйн, Асгатын зэрэг рашаан бий.',
    distanceFromUb: 326,
    timeToReach: '5 цаг 54 мин',
    mustVisitPlaces: [
      '1. Хөгнө тарна байгалийн цогцолборт газар',
      '2. Уран тогоо уул',
      '3. Шивээт улааны цогцолбор',
      '4. Хар бухын балгас',
      '5. Чин толгойн балгас',
      '6. Бий булгын балгас',
      '7. Могойн шинэ ус',
    ],
    hotels: ihotels,
    trips: trips,
    imageUrl: 'assets/images/bayanulgii.jpg',
  ),
];
