import 'package:flutter_travel_ui/models/province_model.dart';
import 'package:flutter_travel_ui/models/trip_model.dart';

import '../ihotel_model.dart';

final List<Province> zuunProvinces = [
  Province(
    name: 'Хэнтий',
    center: 'Өндөрхаан',
    logo: 'assets/provinces/hentii/logo.png',
    address: 'assets/provinces/hentii/address.jpg',
    shortDesc:
        'Ноён уул,  Бага  Хэнтий зэрэг сүрлэг сайхан сүмбэр уулс бүхий ойт болон тал хээр хосолсон үзэсгэлэнт сайхан нутагтай. Ой хөвчид нь нарс, хус, улиас, гацуур зэрэг 30  гаруй төрлийн мод ургадаг, хангай хөвчдөө хандгай, баавгай, хүдэр, илбэнх, гахай, шилүүс, булга зэрэг ан амьтан араатан жигүүртнээр элбэг баян.\nХэнтий нуруунаас эх авсан Онон, Хэрлэн, Улз, Балж зэрэг 70 гаруй том, жижиг голууд, Ононгийн халуун рашаан, Аварга тосон, Гурван нуур, Тарс, Жаргал нуур зэрэг алжаал, эмгэг тайлах рашаан ус олонтой.',
    distanceFromUb: 331,
    timeToReach: '4 цаг 39 мин',
    mustVisitPlaces: [
      '1. Бурхан Халдун уул',
      '2. Балдан Бэрээвэн хийд',
      '3. Чингисийн гэрэлт хөшөө',
      '4. Дэлүүн болдог',
      '5. Хар зүрхний хөх нуур',
      '6. Хэрлэнгийн хөдөө арал',
      '7. Өглөгчийн хэрэм',
      '8. Рашаан хад',
      '9. Дуурлиг нарсны Хүннүгийн булш',
    ],
    hotels: List<IHotel>(),
    trips: List<Trip>(),
    imageUrl: 'assets/provinces/hentii/img.jpg',
  ),
  Province(
    name: 'Дорнод',
    center: 'Чойбалсан',
    logo: 'assets/provinces/dornod/logo.png',
    address: 'assets/provinces/dornod/address.jpg',
    shortDesc:
        'Тус аймгийн нутаг нь Далайн түвшнээс дээш 560-1300 м өргөгдсөн ухаа, гүвээ бүхий тал нутаг юм. Нутгийн Зүүн өмнөд хэсэгт Мэнэн, Тамсаг, Матадын өргөн талуудтайгаас гадна Дорнод талын үзэсгэлэн болсон Буурь нуур, Хөх нуур зэрэг томоохон нуур цөөрмүүдтэй.\n\tХалх-Нөмрөгийн, Дорнод Монголын, Монгол Дагуурын дархан цаазат, Угтам, Тосон-Хулстайн байгалийн нөөц газар, Онон-Балжийн байгалийн дурсгалт газруудтай.',
    distanceFromUb: 655,
    timeToReach: '9 цаг 3 мин',
    mustVisitPlaces: [
      '1. Чингисийн хэрмэн цав',
      '2. Хэрлэн Барс хотын туурь, цамхаг',
      '3. Буйр нуур',
      '4. Хайлангийн хадны хүн дүрст чулуу, дөрвөлжин булш',
      '5. Их бурхант чулуун бурханы цогцолбор',
      '6. Шонх таван толгойн хүн чулуун хөшөө',
      '7. Хамар даваа дээрх ялалтын хөшөө',
      '8. Халх гол',
      '9. Вангийн цагаан уул',
    ],
    hotels: List<IHotel>(),
    trips: List<Trip>(),
    imageUrl: 'assets/provinces/dornod/img.jpg',
  ),
  Province(
    name: 'Сүхбаатар',
    center: 'Баруун-Урт',
    logo: 'assets/provinces/sukhbaatar/logo.png',
    address: 'assets/provinces/sukhbaatar/address.jpg',
    shortDesc:
        'Сэлэнгэ мөрний хөвөө, нутаг газраар нүүдэллэн оршиж байсан эртний сурвалжит Монгол туургатан, овог аймгуудын буурал түүхээс улбаатай Сэлэнгэ аймгийн үүсэл хөгжил, өнөөгийн дүр төрх, ирээдүйн чиг хандлагын анхдагч товч мэдээллийг, сонороо мялаагч эрхэм танд хүргэхэд энэхүү танилцуулгын зорилго оршвой.\n\tСэлэнгэ, Орхон, Хараа, Ерөө зэрэг Монгол орны томоохон гол мөрнүүд урсдаг. Ерөөгийн, Товхонханы, Хондын, Могойн зэрэг рашаануудтай ба нутгийн ихэнхи хэсэгт уулын хар шороон хөрс, гол мөрний хөндийн хагшаа хурдаст хөрс тархжээ.',
    distanceFromUb: 560,
    timeToReach: '7 цаг 30 мин',
    mustVisitPlaces: [
      '1. Алтан овоо',
      '2. Шилийн богд',
      '3. Монголын хүн чулууд',
      '4. Таван толгойн археологийн цогцолбор',
      '5. Ганга нуур, Оргихын булаг',
      '6. Хунгийн чуулган',
      '7. Егүзэрийн хийд',
    ],
    hotels: List<IHotel>(),
    trips: List<Trip>(),
    imageUrl: 'assets/provinces/sukhbaatar/img.jpg',
  ),
];
